# ให้เขียน function ชื่อ day_of_year(day, month ,year)
# โดยมีการคืนค่า คือ day_of_years เป็นวันที่ลําดับที่เท่าใดของปีคริสตศักราช year
# – ปีที่เป็น Leap Year เดือนกุมภาพันธ์จะมี 29 วัน
# – ให้สร้างฟังก์ชัน is_leap เพื่อตรวจสอบ leap year แยกออกมา และให้ฟังก์ชัน day_of_year
# เรียกใช้ is_leap อีกที

# จากโปรแกรมในข้อ 7 ให้เขียนฟังก์ชัน เพิ่มเติมเป็น date_diff
# – รับข้อมูลในรูปแบบ “dd-mm-yyyy” เช่น
# date_diff(“1-1-2018”, “1-1-2020”) จะได้ 731 วัน
# date_diff(“25-12-1999”, “9-3-2000”) จะได้ 76 วัน
# – ให้เขียนฟังก์ชัน day_in_year โดยจะส่งค่าจํานวนวันของปี (365 หรือ 366) โดยรับข้อมูลเป็น ป– ส่งคืนข้อมูลเป็นจํานวนวันตั้งแต่วันที่แรก จนถึงวันที่สอง โดยรวมทั้ง 2 วันนั้นเข้าไปด้วย
# – ให้สมมติว่าวันแรก จะต้องมาก่อนวันที่สองเสมอ ดังนั้นไม่ต้องตรวจสอบ

# จากโปรแกรมในข้อ 8 ให้เขียนฟังก์ชัน date_diff เพิ่มเติม โดยให้มีการตรวจสอบ
# – วันที่ต้องเป็นวันที่ถูกต้องของเดือนนั้นๆ
# – เดือนต้องอยู่ระหว่าง 1-12
# – เดือนกุมภาพันธ์ของปีที่มี Leap Year เท่านั้นที่จะมี 29 วันได้
# – หากข้อมูล Input ผิดพลาด ให้ Return -1