# 4.2 : Student
# • โดยใช้กลุม ่ เดิ ม ใช้ระบบ Pair Programmer คือ คนที่ 1 บอก Code ให้คนที่ 2 เขี ยนตามคําบอก
# โดยหากไม่เห็นด้วย สามารถทักท้วงได้
# • ให้เขียนโปรแกรม เพื่อสร้างคลาสต่อไปนี้
# – นักศึกษา (Student) โดยมี attribute : student_id, student_name
# – รายวิชา (Subject) โดยมี attribute : subject_id, subject_name, section, credit
# – ผู้สอน (Teacher) โดยมี attribute : teacher_id, teacher_name
# – สามารถเพิ่ม attribute อืน ่ ๆ ได้
# ให้สร้าง Instance ของทุกคลาส และ สร้างความสัมพันธ์ (สามารถเพิ่ม attribute ได้)
# – ให้สร้าง instance ของนักศึกษา 5 คนขึ้นไป
# – ให้สร้าง instance ของอาจารย์ 2 คน
# – ให้สร้าง instance ของวิชา object oriented programming 2 instance 2 section โดยแต่ละ
# section มีผ ส ู้ อนคนละคน และแต่ละ section มีคนเรียนอย่ างน้อย 2 คน
# – ข้อมูลใน Instance ให้เป็นข้อมูลที่จริงจังสักหน่อย
# ให้เขียนฟั งก์ชัน #1 โดยเมื่อใส่ รหัสผู ส ้ อน แล้วสามารถบอกได้ว่ามี นศ. คนไหนบ้างที่เรียนกับผู้สอนนี้
# โดยให้บอกเป็นชื่อนักศึกษา
# ให้เขียนฟั งก์ชัน #2 โดยเมื่อใส่ รหัส นศ. แล้วบอกว่าเรียนวิ ชาอะไรบ้าง โดยให้บอกเป็นชื่อวิชา
# ข้อมูลทัง ้ หมดต้ องอยู่ในคลาสเท่านั้น ยกเว้น List ที่เก็บ นศ. ทั้งหมด วิชาทั้งหมด อาจารย์ทง ั้ หมด ให้
# อยู่ข้างนอกได้ และห้ามใช้ dictionary ในการเก็บข้อมูล