# 4.3 : พี่รหัส
# • ให้แก้ไขคลาส student โดยเพิม ่ ข้อมูล พี่รหัส (student_menter) หมายถึงนักศึกษาที่เป็นพีร ่ หัสขึ้นไป 1
# ชั้นปีเท่านั้น
# • ให้สร้าง instance ของ นศ. 4 คนขึ้นไป เช่น a เป็นปี 1, b เป็นปี 2 และเป็นพี่รหัสของ a
# c เป็นปี 3 และเป็นพี่รหัสของ b ส่วน d เป็นปี 4 และเป็นพี่รหัสของ c การสร้าง Instance ให้ใช้รหัส
# นักศึกษา 8 หลัก และเลข 2 ตัวแรกตามชั้นปีจริง
# – ให้เขียนฟังก์ชัน #3 โดยเมื่อป้อนรหัสนักศึกษา x แล้วตอบว่ามีพี่รหัส เป็นใครบ้าง โดยให้
# ตอบให้ครบ เช่น ถ้าป้อน a ให้ตอบ b, c, d ถ้าป้อน b ให้ตอบ c, d โดยให้แสดงทั้งรหัส
# นักศึกษาและชื่อ ในการแสดงให้แสดงกรณีไม่ มพ ี ี่รหัสด้วย
# – ให้เขียนฟังก์ชัน #4 โดยเมือ ่ ป้อนรหัสนักศึกษา Student x และ student y ให้ตรวจสอบว่าเป็น
# สายรหัสกันหรือไม่ ให้ตอบเป็น True และ False
# • โปรแกรมอาจแยกเขียนจากโปรแกรม 4.2 ก็ได้